test/fixtures/xml/fedex/error.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns='http://fedex.com/ws/rate/v13'>
  <soapenv:Header/>
  <soapenv:Body>
    <RateRequest>
      <WebAuthenticationDetail>
        <UserCredential>
          <Key>rscqm75MLampLUuV</Key>
          <Password>8rTZHQ6vbyOsGOgtwMXrZ1kIU</Password>
        </UserCredential>
      </WebAuthenticationDetail>
      <ClientDetail>
        <AccountNumber>510087267</AccountNumber>
        <MeterNumber>118511895</MeterNumber>
      </ClientDetail>
      <Version>
        <ServiceId>crs</ServiceId>
        <Major>13</Major>
        <Intermediate>0</Intermediate>
        <Minor>0</Minor>
      </Version>
      <ReturnTransitAndCommit>true</ReturnTransitAndCommit>
      <VariableOptions>SATURDAY_DELIVERY</VariableOptions>
      <RequestedShipment>
        <ShipTimestamp>2014-05-20T20:33:45.78Z</ShipTimestamp>
        <DropoffType>REGULAR_PICKUP</DropoffType>
        <PackagingType>YOUR_PACKAGING</PackagingType>
        <Shipper>
          <Address>
            <PostalCode>11510</PostalCode>
            <CountryCode>mx</CountryCode>
          </Address>
        </Shipper>
        <Recipient>
          <Address>
            <PostalCode>11510</PostalCode>
            <CountryCode>mx</CountryCode>
          </Address>
        </Recipient>
        <RateRequestTypes>LIST</RateRequestTypes>
        <PackageCount>1</PackageCount>
        <RequestedPackageLineItems>
          <GroupPackageCount>1</GroupPackageCount>
          <Weight>
            <Units>KG</Units>
            <Value>2.0</Value>
          </Weight>
        </RequestedPackageLineItems>
      </RequestedShipment>
    </RateRequest>
  </soapenv:Body>
</soapenv:Envelope>